{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"xs_1": {"name": "xs_1:0", "dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "9"}]}}, "xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}]}}}, "outputs": {"output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_4/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_6/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_9/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_8/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_4/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_11/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_10/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_5/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_13/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_12/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_6/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_15/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_14/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_7/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_17/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_16/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/Actor_Head/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_0/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_head/pjit__where_/BroadcastTo", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_21/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "29"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_20/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_23/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_22/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_25/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_24/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_27/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_26/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_4/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_29/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_28/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_5/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_31/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_30/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_6/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_33/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_32/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_7/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_35/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_34/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/Critic_Head/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_19/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_18/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_head/pjit__squeeze_/Reshape/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "29"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "xs_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "9"}]}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/ExpandDims", "op": "ExpandDims", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/ExpandDims", "op": "ExpandDims", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_21/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/Squeeze", "StatefulPartitionedCall/jax2tf_arg_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/Squeeze", "StatefulPartitionedCall/jax2tf_arg_20/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/NotEqual", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Abs", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/NotEqual", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Abs", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Exp", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Neg"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Log1p", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Log1p", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Exp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Maximum", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Log1p"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Maximum", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Log1p"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/NotEqual", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/AddV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/NotEqual", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/AddV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_tanh_/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_tanh_/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_fn_/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_tanh_/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_fn_/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_0/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_tanh_/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_fn_/Mul", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_fn_/Mul", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_23/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/Squeeze", "StatefulPartitionedCall/jax2tf_arg_4/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/Squeeze", "StatefulPartitionedCall/jax2tf_arg_22/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_1", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Maximum_1", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Abs_1", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_1", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Maximum_1", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Abs_1", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Neg_1", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Abs_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Neg_1", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Abs_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Exp_1", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Neg_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Exp_1", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Neg_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Log1p_1", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Exp_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Log1p_1", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Exp_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/AddV2_3", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Maximum_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Log1p_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/AddV2_3", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Maximum_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Log1p_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/SelectV2_1", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/AddV2_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/SelectV2_1", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/AddV2_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_tanh_/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/SelectV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_tanh_/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/SelectV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_fn_/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_tanh_/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_fn_/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_1/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_tanh_/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_fn_/Mul_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_fn_/Mul_1", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_7/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_25/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/Squeeze", "StatefulPartitionedCall/jax2tf_arg_6/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/Squeeze", "StatefulPartitionedCall/jax2tf_arg_24/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_2", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Maximum_2", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Abs_2", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_2", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Maximum_2", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Abs_2", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Neg_2", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Abs_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Neg_2", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Abs_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Exp_2", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Neg_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Exp_2", "op": "Exp", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Neg_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Log1p_2", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Exp_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Log1p_2", "op": "Log1p", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Exp_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/AddV2_5", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Maximum_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Log1p_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/AddV2_5", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Maximum_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Log1p_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/SelectV2_2", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/AddV2_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/SelectV2_2", "op": "SelectV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/AddV2_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_tanh_/Tanh_2", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/SelectV2_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_tanh_/Tanh_2", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/SelectV2_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_fn_/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_2/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_tanh_/Tanh_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_fn_/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_2/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_tanh_/Tanh_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_fn_/Mul_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_fn_/Mul_2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_9/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/ExpandDims", "StatefulPartitionedCall/jax2tf_arg_27/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/Squeeze", "StatefulPartitionedCall/jax2tf_arg_8/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/Squeeze", "StatefulPartitionedCall/jax2tf_arg_26/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_3", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Maximum_3", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Cast_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/pjit_softplus_/pjit_logaddexp_/Abs_3", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/actor_neck/Layer_3/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/NotEqual_3", "op": "NotEqual", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/pjit_fn_/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Maximum_3", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/Layer_3/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Cast_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_apply_/ActorCriticModel/critic_neck/pjit_softplus_/pjit_logaddexp_/Abs_3", "op": "Abs", "input": 